#+Author: Harun Sheikhali
#+Date: Sun Jan 16th, 2022

** Basic Configuration
   #+begin_src emacs-lisp
     (use-package gcmh
		  :diminish gcmh-mode
		  :config
		  (setq gcmh-idle-delay 5
			gcmh-high-cons-threshold (* 16 1024 1024)) ;; this represets 16mb
		  (gcmh-mode 1))
     (add-hook 'emacs-startup-hook
	       (lambda ()
		 (setq gc-cons-percentage 0.1)))

     (add-hook 'emacs-startup-hook
	       (lambda ()
		 (message "Emacs ready in %s with %d garbage collections."
			  (format "%.2f seconds"
				  (float-time
				   (time-subtract after-init-time before-init-time)))
			  gcs-done)))
     (fset 'yes-or-no-p 'y-or-n-p)
     (setq confirm-kill-emacs 'yes-or-no-p)
     (setq frame-resize-pixelwise t)
     (setq window-resize-pixelwise nil)
     (setq-default truncate-lines t)
     (setq-default tab-width 2)
     (setq-default fill-column 80)

     ;; configure path
     (when (memq window-system '(mac ns x))
	     (exec-path-from-shell-initialize))
   #+end_src

	 #+RESULTS:
	 : ((MANPATH . /Users/hsheikhali/.nvm/versions/node/v14.18.1/share/man:/usr/share/man:/usr/local/share/man:/usr/local/MacGPG2/share/man:/opt/X11/share/man) (PATH . /Users/hsheikhali/.nvm/versions/node/v14.18.1/bin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Applications/VMware Fusion.app/Contents/Public:/usr/local/go/bin:/usr/local/MacGPG2/bin:/opt/X11/bin:/Users/hsheikhali/.nvm/versions/node/v14.18.1/bin:/Users/hsheikhali/.fig/bin:/Users/hsheikhali/.antigen/bundles/robbyrussell/oh-my-zsh/lib:/Users/hsheikhali/.antigen/bundles/robbyrussell/oh-my-zsh/plugins/git:/Users/hsheikhali/.antigen/bundles/robbyrussell/oh-my-zsh/plugins/command-not-found:/Users/hsheikhali/.antigen/bundles/robbyrussell/oh-my-zsh/plugins/docker:/Users/hsheikhali/.antigen/bundles/zsh-users/zsh-completions:/Users/hsheikhali/.antigen/bundles/zsh-users/zsh-autosuggestions:/Users/hsheikhali/.antigen/bundles/zsh-users/zsh-syntax-highlighting:/Users/hsheikhali/.antigen/bundles/jeffreytse/zsh-vi-mode:/Users/hsheikhali/go/bin:/Users/hsheikhali/go/bin:/usr/local/go/bin))
   
** Projectile
   #+begin_src emacs-lisp
		 (use-package projectile)
		 (projectile-mode 1)
		 (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
		 (setq projectile-project-search-path '("~/.dev/" "~/.personal/"))
	 #+end_src

   #+RESULTS:
	 | ~/.dev/ | ~/.personal/ |

** Development configuration
	 This section will contain the majority of configuration needed for modern web development (HTML, TS, React, etc)
		#+begin_src emacs-lisp
			(setq indent-tabs-mode nil)
			(defun harun/webmode-hook ()
				"My personal webmode hook"
				(setq web-mode-markup-indent-offset 2)
				(setq web-mode-enable-comment-annotations t)
				(setq web-mode-code-indent-offset 2)
				(setq web-mode-css-indent-offset 2)
				(setq web-mode-attr-indent-offset 0)
				(setq web-mode-enable-auto-indentation t)
				(setq web-mode-enable-auto-pairing t)
				(setq web-mode-enable-auto-closing t)
				(setq web-mode-enable-css-colorization t)
				(highlight-indent-guides-mode))

			;; TODO -- Add other web mode hook configs
			;; TODO -- Add other language support like react, eslint etc


			(use-package web-mode
				:hook (
							 (web-mode . harun/webmode-hook)
							 (web-mode . lsp)
							 (css-mode . lsp)
							 (scss-mode . lsp)
							 )
				:commands (web-mode)
				:mode (("\\.tsx\\'" . web-mode)
							 ("\\.html\\'" . web-mode)))

			(use-package lsp-mode
				:commands (lsp lsp-deferred))

			(use-package typescript-mode
				:hook (
							 (typescript-mode . lsp)
							 (typescript-mode . highlight-indent-guides-mode)
							 )
				:config
				(setq-default typescript-indent-level 2))

			(use-package flycheck)
			(add-hook 'after-init-hook #'global-flycheck-mode)

			;; disable tslint because it is deprecated and no one uses it anyway..
			(setq-default flycheck-disabled-checkers
										(append flycheck-disabled-checkers
														'(typescript-tslint)))
			(flycheck-add-mode 'javascript-eslint 'web-mode)
			(flycheck-add-mode 'javascript-eslint 'typescript-mode)
			(setq-default flycheck-temp-prefix ".flycheck")
		#+end_src

    #+RESULTS:
    : .flycheck
		
